Crop area sketch can either be empty or include one closed, not self-intersecting loop.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId InvalidCropAreaSketch { get; }
  Visual Basic
Public Shared ReadOnly Property InvalidCropAreaSketch As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ InvalidCropAreaSketch {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace